<?php

return [

    /**
     * 根据业务分组使用错误码，比如9xx为系统错误码， 100~119 系统用户管理错误
     */
    "code" => [
        '000' => '成功！',

        # 用户异常
        '100' => '用户名已存在！',
        '101' => '密码错误！',
        '102' => '用户[%s]正在使用该角色！无法删除！',
        '103' => '节点不存在',

        # OSS异常
        '200' => 'OSS配置错误：%s',

        # APK

        '301' => '域名格式错误',


        # 9xx 系统错误码，为通用性错误码，禁止配置业务错误
        '991' => '请先登录！',
        '992' => '您没有这个权限访问！',
        '993' => '数据不存在！',

        '997' => '参数错误！',
        '998' => '路由未定义！',
        '999' => '系统异常！',
    ],
];
